import React from "react";
import Image from "../assets/logo.png";
import SidebarCard from "../components/UI/SidebarCard";
import Map from "../assets/map.png";
import cldr from "../assets/calendar.png";
import clk from "../assets/clk.png";
const Sidebar = (props) => {
  return (
    <>
      <div
        className={`fixed h-full bg-[#fdfdfd] w-[350px] p-[24px] z-[999] top-0 right-0 overflow-y-scroll transition duration-300  ${
          props.isOpen ? "translate-x-0" : " translate-x-full"
        }`}
      >
        <div className="flex items-start justify-between mb-8">
          <div className="max-w-[160px] bg-primary-100 py-3 px-4 rounded">
            <img className="w-full" src={Image} alt="" />
          </div>
          <button
            onClick={() => props.setIsOpen(false)}
            className="bg-[#f5f5f9] p-3 rounded"
          >
            <svg
              enable-background="new 0 0 96 96"
              id="arrow_left"
              version="1.1"
              viewBox="0 0 96 96"
              width="1rem"
            >
              <path d="M84,44H21.656l21.456-21.456c1.562-1.562,1.562-4.095,0.001-5.657c-1.562-1.562-4.096-1.562-5.658,0L9.172,45.171l0,0  c-0.186,0.186-0.352,0.391-0.498,0.61c-0.067,0.101-0.114,0.21-0.171,0.315c-0.067,0.124-0.142,0.242-0.196,0.373  c-0.056,0.135-0.088,0.276-0.129,0.416c-0.032,0.111-0.075,0.217-0.098,0.331C8.028,47.475,8,47.737,8,48l0,0  c0,0.003,0.001,0.005,0.001,0.008c0,0.259,0.027,0.519,0.078,0.774c0.024,0.121,0.069,0.232,0.104,0.349  c0.039,0.133,0.07,0.268,0.123,0.397c0.058,0.139,0.136,0.265,0.208,0.396c0.054,0.098,0.096,0.198,0.159,0.292  c0.147,0.221,0.314,0.427,0.501,0.614l28.282,28.281c1.562,1.562,4.095,1.562,5.657,0.001c1.562-1.562,1.562-4.096,0-5.658  L21.657,52H84c2.209,0,4-1.791,4-4S86.209,44,84,44z"></path>
            </svg>
          </button>
        </div>
        <SidebarCard>
          <div className="flex gap-2 items-center mb-1">
            <img src={Map} alt="" />
            <span className="text-[12px]">العنوان</span>
          </div>
          <h1 className="font-bold ">سوريا - دمشق</h1>
        </SidebarCard>
        <SidebarCard>
          <div className="flex gap-2 items-center mb-1">
            <svg
              viewBox="64 64 896 896"
              focusable="false"
              data-icon="phone"
              width="0.7em"
              height="0.7em"
              fill="currentColor"
              aria-hidden="true"
            >
              <path d="M885.6 230.2L779.1 123.8a80.83 80.83 0 00-57.3-23.8c-21.7 0-42.1 8.5-57.4 23.8L549.8 238.4a80.83 80.83 0 00-23.8 57.3c0 21.7 8.5 42.1 23.8 57.4l83.8 83.8A393.82 393.82 0 01553.1 553 395.34 395.34 0 01437 633.8L353.2 550a80.83 80.83 0 00-57.3-23.8c-21.7 0-42.1 8.5-57.4 23.8L123.8 664.5a80.89 80.89 0 00-23.8 57.4c0 21.7 8.5 42.1 23.8 57.4l106.3 106.3c24.4 24.5 58.1 38.4 92.7 38.4 7.3 0 14.3-.6 21.2-1.8 134.8-22.2 268.5-93.9 376.4-201.7C828.2 612.8 899.8 479.2 922.3 344c6.8-41.3-6.9-83.8-36.7-113.8z"></path>
            </svg>
            <span className="text-[12px]">هاتف</span>
          </div>
          <h1 className="font-bold ">+963948888118</h1>
        </SidebarCard>
        <SidebarCard>
          <div className="flex gap-2 items-center mb-1">
            <img src={cldr} alt="" />
            <span className="text-[12px]">ايام العمل</span>
          </div>
          <h1 className="font-[700] text-[13px] mb-1">السبت</h1>
          <h1 className="font-[700] text-[13px] mb-1">الأحد</h1>
          <h1 className="font-[700] text-[13px] mb-1">الإثنين</h1>
          <h1 className="font-[700] text-[13px] mb-1">الثلاثاء</h1>
          <h1 className="font-[700] text-[13px] mb-1">الاربعاء</h1>
          <h1 className="font-[700] text-[13px] mb-1">الخميس</h1>
          <h1 className="font-[700] text-[13px] ">الجمعة</h1>
        </SidebarCard>
        <SidebarCard>
          <div className="flex gap-2 items-center mb-1">
            <img src={clk} alt="" />
            <span className="text-[12px]">ساعات العمل</span>
          </div>
          <h1 className="font-bold text-[13px] mb-1">بداية الدوام: 08:00</h1>
          <h1 className="font-bold text-[13px]">نهاية الدوام: 08:00</h1>
        </SidebarCard>
        <SidebarCard>
          <div className="flex items-center gap-4 justify-center">
            <a href="/">
              <svg
                viewBox="64 64 896 896"
                focusable="false"
                data-icon="whats-app"
                width="1.5em"
                height="1.5em"
                fill="currentColor"
                aria-hidden="true"
              >
                <defs>
                  <style></style>
                </defs>
                <path d="M713.5 599.9c-10.9-5.6-65.2-32.2-75.3-35.8-10.1-3.8-17.5-5.6-24.8 5.6-7.4 11.1-28.4 35.8-35 43.3-6.4 7.4-12.9 8.3-23.8 2.8-64.8-32.4-107.3-57.8-150-131.1-11.3-19.5 11.3-18.1 32.4-60.2 3.6-7.4 1.8-13.7-1-19.3-2.8-5.6-24.8-59.8-34-81.9-8.9-21.5-18.1-18.5-24.8-18.9-6.4-.4-13.7-.4-21.1-.4-7.4 0-19.3 2.8-29.4 13.7-10.1 11.1-38.6 37.8-38.6 92s39.5 106.7 44.9 114.1c5.6 7.4 77.7 118.6 188.4 166.5 70 30.2 97.4 32.8 132.4 27.6 21.3-3.2 65.2-26.6 74.3-52.5 9.1-25.8 9.1-47.9 6.4-52.5-2.7-4.9-10.1-7.7-21-13z"></path>
                <path d="M925.2 338.4c-22.6-53.7-55-101.9-96.3-143.3a444.35 444.35 0 00-143.3-96.3C630.6 75.7 572.2 64 512 64h-2c-60.6.3-119.3 12.3-174.5 35.9a445.35 445.35 0 00-142 96.5c-40.9 41.3-73 89.3-95.2 142.8-23 55.4-34.6 114.3-34.3 174.9A449.4 449.4 0 00112 714v152a46 46 0 0046 46h152.1A449.4 449.4 0 00510 960h2.1c59.9 0 118-11.6 172.7-34.3a444.48 444.48 0 00142.8-95.2c41.3-40.9 73.8-88.7 96.5-142 23.6-55.2 35.6-113.9 35.9-174.5.3-60.9-11.5-120-34.8-175.6zm-151.1 438C704 845.8 611 884 512 884h-1.7c-60.3-.3-120.2-15.3-173.1-43.5l-8.4-4.5H188V695.2l-4.5-8.4C155.3 633.9 140.3 574 140 513.7c-.4-99.7 37.7-193.3 107.6-263.8 69.8-70.5 163.1-109.5 262.8-109.9h1.7c50 0 98.5 9.7 144.2 28.9 44.6 18.7 84.6 45.6 119 80 34.3 34.3 61.3 74.4 80 119 19.4 46.2 29.1 95.2 28.9 145.8-.6 99.6-39.7 192.9-110.1 262.7z"></path>
              </svg>
            </a>
            <a href="/">
              <svg
                viewBox="64 64 896 896"
                focusable="false"
                data-icon="instagram"
                width="1.5em"
                height="1.5em"
                fill="currentColor"
                aria-hidden="true"
              >
                <path d="M512 306.9c-113.5 0-205.1 91.6-205.1 205.1S398.5 717.1 512 717.1 717.1 625.5 717.1 512 625.5 306.9 512 306.9zm0 338.4c-73.4 0-133.3-59.9-133.3-133.3S438.6 378.7 512 378.7 645.3 438.6 645.3 512 585.4 645.3 512 645.3zm213.5-394.6c-26.5 0-47.9 21.4-47.9 47.9s21.4 47.9 47.9 47.9 47.9-21.3 47.9-47.9a47.84 47.84 0 00-47.9-47.9zM911.8 512c0-55.2.5-109.9-2.6-165-3.1-64-17.7-120.8-64.5-167.6-46.9-46.9-103.6-61.4-167.6-64.5-55.2-3.1-109.9-2.6-165-2.6-55.2 0-109.9-.5-165 2.6-64 3.1-120.8 17.7-167.6 64.5C132.6 226.3 118.1 283 115 347c-3.1 55.2-2.6 109.9-2.6 165s-.5 109.9 2.6 165c3.1 64 17.7 120.8 64.5 167.6 46.9 46.9 103.6 61.4 167.6 64.5 55.2 3.1 109.9 2.6 165 2.6 55.2 0 109.9.5 165-2.6 64-3.1 120.8-17.7 167.6-64.5 46.9-46.9 61.4-103.6 64.5-167.6 3.2-55.1 2.6-109.8 2.6-165zm-88 235.8c-7.3 18.2-16.1 31.8-30.2 45.8-14.1 14.1-27.6 22.9-45.8 30.2C695.2 844.7 570.3 840 512 840c-58.3 0-183.3 4.7-235.9-16.1-18.2-7.3-31.8-16.1-45.8-30.2-14.1-14.1-22.9-27.6-30.2-45.8C179.3 695.2 184 570.3 184 512c0-58.3-4.7-183.3 16.1-235.9 7.3-18.2 16.1-31.8 30.2-45.8s27.6-22.9 45.8-30.2C328.7 179.3 453.7 184 512 184s183.3-4.7 235.9 16.1c18.2 7.3 31.8 16.1 45.8 30.2 14.1 14.1 22.9 27.6 30.2 45.8C844.7 328.7 840 453.7 840 512c0 58.3 4.7 183.2-16.2 235.8z"></path>
              </svg>
            </a>
            <a href="/">
              <svg
                viewBox="64 64 896 896"
                focusable="false"
                data-icon="facebook"
                width="1.5em"
                height="1.5em"
                fill="currentColor"
                aria-hidden="true"
              >
                <path d="M880 112H144c-17.7 0-32 14.3-32 32v736c0 17.7 14.3 32 32 32h736c17.7 0 32-14.3 32-32V144c0-17.7-14.3-32-32-32zm-92.4 233.5h-63.9c-50.1 0-59.8 23.8-59.8 58.8v77.1h119.6l-15.6 120.7h-104V912H539.2V602.2H434.9V481.4h104.3v-89c0-103.3 63.1-159.6 155.3-159.6 44.2 0 82.1 3.3 93.2 4.8v107.9z"></path>
              </svg>
            </a>
          </div>
        </SidebarCard>
      </div>
      {props.isOpen && (
        <div
          onClick={() => props.setIsOpen(false)}
          className="fixed top-0 left-0 w-full h-full bg-black opacity-50 z-[900]"
        ></div>
      )}
    </>
  );
};

export default Sidebar;
